MENU = '1. Просмотр каталога\n' + \
       '2. На уровень вверх\n' + \
       '3. На уровень вниз\n' + \
       '4. Колличество файлов и каталогов\n' + \
       '5. Размер всех файлов в текущем каталоге\n' + \
       '6. Поиск файла\n' + \
       '7. Выход из программы\n' + \
       'Выберете пункт меню:'
QUIT = 7
CURRENT_DIR = 'Введите имя нужного подкаталога: '
ERROR_DOWN = 'Не удается найти указанный файл.'
END = 'Работа программы завершена.'
INPUT_FILE = 'Введите название файла: '
TRUE_FILE = 'Такой файл существует.'
FALSE_FILE = 'Такого файла нет.'
